import asyncio
from database import CafeOrm, MenuItemOrm, new_session, create_tables

async def load_sample_data():
    """
    Загружает тестовые данные кафе и меню из этого файла
    """
    # Создать таблицы, если их ещё нет
    await create_tables()

    async with new_session() as session:
        # Добавим кафе с полной информацией
        cafes = [
            CafeOrm(
                name="Пандасад",
                description="Вкусная азиатская кухня с большим выбором блюд. Лапша, рис, супы и многое другое.",
                category="Азиатская кухня",
                location="Учебный корпус, 1 этаж",
                icon="🍜"
            ),
            CafeOrm(
                name="Пицца Хот",
                description="Свежая горячая пицца на любой вкус. Готовим быстро, доставляем горячей!",
                category="Итальянская кухня",
                location="Поточный корпус, 2 этаж",
                icon="🍕"
            ),
            CafeOrm(
                name="FENI",
                description="Лучший кофе в кампусе! Также большой выбор чая, смузи и других напитков.",
                category="Кофейня",
                location="Лабораторный корпус, 1 этаж",
                icon="☕"
            ),
            CafeOrm(
                name="Картошка",
                description="Аппетитная картошечка в различных вариациях. Фри, по-деревенски, драники и многое другое!",
                category="Фастфуд",
                location="3 этаж, переход из ЛК в Учебный корпус",
                icon="🥔"
            )
        ]
        
        session.add_all(cafes)
        await session.flush()  # получим cafe.id

        # Добавим несколько блюд для каждого кафе
        menu_items = [
            # Пандасад (Азиатская кухня)
            MenuItemOrm(cafe_id=cafes[0].id, name="Борщ", description="Традиционный русский суп", price=200.0),
            MenuItemOrm(cafe_id=cafes[0].id, name="Пельмени", description="Домашние пельмени", price=250.0),
            MenuItemOrm(cafe_id=cafes[0].id, name="Чай", description="Черный чай", price=50.0),
            
            # Пицца Хот
            MenuItemOrm(cafe_id=cafes[1].id, name="Пицца Маргарита", description="Классическая пицца с сыром моцарелла", price=300.0),
            MenuItemOrm(cafe_id=cafes[1].id, name="Пицца Пепперони", description="Пицца с острой колбасой пепперони", price=350.0),
            
            # FEIN (Кофейня)
            MenuItemOrm(cafe_id=cafes[2].id, name="Капучино", description="Классический итальянский кофе", price=150.0),
            MenuItemOrm(cafe_id=cafes[2].id, name="Кока-кола", description="Освежающий напиток", price=100.0),
            
            # Картошка
            MenuItemOrm(cafe_id=cafes[3].id, name="Картофель фри", description="Хрустящая картошка фри", price=120.0),
            MenuItemOrm(cafe_id=cafes[3].id, name="Картошка по-деревенски", description="Картошка с хрустящей корочкой", price=150.0),
        ]
        
        session.add_all(menu_items)
        await session.commit()
        
    print(f"✅ Загружено {len(cafes)} кафе и {len(menu_items)} блюд из fill_sample_data.py")
    return len(cafes)

if __name__ == "__main__":
    asyncio.run(load_sample_data())